DangMyLinh_20121974_tuan_5_signup_4_layout/app/views/users/show.html.erb


<p>
  <strong>Email:</strong>
  <%= @user.email %>
</p>
<% posts = @user.microposts.all %>
<% if posts.size > 0  %>
<strong>Micropost: <span style="color:red;"; ><%=posts.size%></span></strong>
<ul class= "show-micropost">
<% i= 1%>
<% posts.each do |post| %>
<li><%=i%>) <%= link_to post.content, post  %></li>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 980190962]]