DangMyLinh_20121974_tuan_5_signup_4_layout/app/views/microposts/_form.html.erb

    <!--%= f.number_field :user_id %-->
    <%= f.collection_select :user_id, User.all,:id, :name,:prompt =>true  %>
---
SELECT "users".* FROM "users"